-- Warrior Rotation Helper by Timofeev Alexey
------------------------------------------------------------------------------------------------------------------
----------------------------------------------------------------------------------------------------------------
--[[SetCommand("fear",
    function(target)
        if DoSpell("Устрашающий крик", target) then
            echo("Устрашающий крик!", 1)
        end
    end,
    function(target)
        return not CanControl(target) or HasDebuff("Устрашающий крик", 0,1, target) or not IsSpellNotUsed("Устрашающий крик", 1)
    end
)]]
------------------------------------------------------------------------------------------------------------------
