-- Paladin Rotation Helper by Timofeev Alexey
------------------------------------------------------------------------------------------------------------------
----------------------------------------------------------------------------------------------------------------
SetCommand("stun",
    function(target)
        if DoSpell("Молот правосудия", target) then
            echo("Молот правосудия!", 1)
        end
    end,
    function(target)
        return HasDebuff("Молот правосудия", 0,1, target) or not IsSpellNotUsed("Молот правосудия", 1)
    end
)
------------------------------------------------------------------------------------------------------------------
